## Plan Result (prod-global)




<pre><code>Plan: 0 to add, 2 to change, 0 to destroy.</code></pre>

* Update
  * module.landing_zone.azurerm_frontdoor.main
  * module.landing_zone.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.landing_zone.data.azurerm_monitor_diagnostic_categories.diagnostic_categories will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id          = (known after apply)
      + logs        = (known after apply)
      + metrics     = (known after apply)
      + resource_id = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod"

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor.main will be updated in-place
  ~ resource "azurerm_frontdoor" "main" {
        id                                           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod"
        name                                         = "hmcts-prod"
        tags                                         = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "production"
        }
        # (14 unchanged attributes hidden)

      ~ backend_pool {
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/backendPools/div-dn"
            name                = "div-dn"
            # (2 unchanged attributes hidden)

          ~ backend {
              ~ address     = "firewall-prod-int-palo-prod.uksouth.cloudapp.azure.com" -> "firewall-prod-int-palo-cft-prod.uksouth.cloudapp.azure.com"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/backendPools/div-da"
            name                = "div-da"
            # (2 unchanged attributes hidden)

          ~ backend {
              ~ address     = "firewall-prod-int-palo-prod.uksouth.cloudapp.azure.com" -> "firewall-prod-int-palo-cft-prod.uksouth.cloudapp.azure.com"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/backendPools/div-rfe"
            name                = "div-rfe"
            # (2 unchanged attributes hidden)

          ~ backend {
              ~ address     = "firewall-prod-int-palo-prod.uksouth.cloudapp.azure.com" -> "firewall-prod-int-palo-cft-prod.uksouth.cloudapp.azure.com"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/backendPools/div-pfe"
            name                = "div-pfe"
            # (2 unchanged attributes hidden)

          ~ backend {
              ~ address     = "firewall-prod-int-palo-prod.uksouth.cloudapp.azure.com" -> "firewall-prod-int-palo-cft-prod.uksouth.cloudapp.azure.com"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/backendPools/div-amend"
            name                = "div-amend"
            # (2 unchanged attributes hidden)

          ~ backend {
              ~ address     = "firewall-prod-int-palo-prod.uksouth.cloudapp.azure.com" -> "firewall-prod-int-palo-cft-prod.uksouth.cloudapp.azure.com"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/backendPools/nfdiv-civil-partnership"
            name                = "nfdiv-civil-partnership"
            # (2 unchanged attributes hidden)

          ~ backend {
              ~ address     = "firewall-prod-int-palo-prod.uksouth.cloudapp.azure.com" -> "firewall-prod-int-palo-cft-prod.uksouth.cloudapp.azure.com"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/backendPools/sscs-tribunals"
            name                = "sscs-tribunals"
            # (2 unchanged attributes hidden)

          ~ backend {
              ~ address     = "firewall-prod-int-palo-prod.uksouth.cloudapp.azure.com" -> "firewall-prod-int-palo-cft-prod.uksouth.cloudapp.azure.com"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/backendPools/sscs-tya"
            name                = "sscs-tya"
            # (2 unchanged attributes hidden)

          ~ backend {
              ~ address     = "firewall-prod-int-palo-prod.uksouth.cloudapp.azure.com" -> "firewall-prod-int-palo-cft-prod.uksouth.cloudapp.azure.com"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/backendPools/sscs-cor"
            name                = "sscs-cor"
            # (2 unchanged attributes hidden)

          ~ backend {
              ~ address     = "firewall-prod-int-palo-prod.uksouth.cloudapp.azure.com" -> "firewall-prod-int-palo-cft-prod.uksouth.cloudapp.azure.com"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/backendPools/xui-webapp"
            name                = "xui-webapp"
            # (2 unchanged attributes hidden)

          ~ backend {
              ~ address     = "firewall-prod-int-palo-prod.uksouth.cloudapp.azure.com" -> "firewall-prod-int-palo-cft-prod.uksouth.cloudapp.azure.com"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/backendPools/xui-manage-org"
            name                = "xui-manage-org"
            # (2 unchanged attributes hidden)

          ~ backend {
              ~ address     = "firewall-prod-int-palo-prod.uksouth.cloudapp.azure.com" -> "firewall-prod-int-palo-cft-prod.uksouth.cloudapp.azure.com"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/backendPools/xui-approve-org"
            name                = "xui-approve-org"
            # (2 unchanged attributes hidden)

          ~ backend {
              ~ address     = "firewall-prod-int-palo-prod.uksouth.cloudapp.azure.com" -> "firewall-prod-int-palo-cft-prod.uksouth.cloudapp.azure.com"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/backendPools/xui-register-org"
            name                = "xui-register-org"
            # (2 unchanged attributes hidden)

          ~ backend {
              ~ address     = "firewall-prod-int-palo-prod.uksouth.cloudapp.azure.com" -> "firewall-prod-int-palo-cft-prod.uksouth.cloudapp.azure.com"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/backendPools/cmc"
            name                = "cmc"
            # (2 unchanged attributes hidden)

          ~ backend {
              ~ address     = "firewall-prod-int-palo-prod.uksouth.cloudapp.azure.com" -> "firewall-prod-int-palo-cft-prod.uksouth.cloudapp.azure.com"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/backendPools/cmc-legal"
            name                = "cmc-legal"
            # (2 unchanged attributes hidden)

          ~ backend {
              ~ address     = "firewall-prod-int-palo-prod.uksouth.cloudapp.azure.com" -> "firewall-prod-int-palo-cft-prod.uksouth.cloudapp.azure.com"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/backendPools/gateway-ccd"
            name                = "gateway-ccd"
            # (2 unchanged attributes hidden)

          ~ backend {
              ~ address     = "firewall-prod-int-palo-prod.uksouth.cloudapp.azure.com" -> "firewall-prod-int-palo-cft-prod.uksouth.cloudapp.azure.com"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/backendPools/return-case-doc-ccd"
            name                = "return-case-doc-ccd"
            # (2 unchanged attributes hidden)

          ~ backend {
              ~ address     = "firewall-prod-int-palo-prod.uksouth.cloudapp.azure.com" -> "firewall-prod-int-palo-cft-prod.uksouth.cloudapp.azure.com"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/backendPools/probate"
            name                = "probate"
            # (2 unchanged attributes hidden)

          ~ backend {
              ~ address     = "firewall-prod-int-palo-prod.uksouth.cloudapp.azure.com" -> "firewall-prod-int-palo-cft-prod.uksouth.cloudapp.azure.com"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/backendPools/ia-aip"
            name                = "ia-aip"
            # (2 unchanged attributes hidden)

          ~ backend {
              ~ address     = "firewall-prod-int-palo-prod.uksouth.cloudapp.azure.com" -> "firewall-prod-int-palo-cft-prod.uksouth.cloudapp.azure.com"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/backendPools/fees-register"
            name                = "fees-register"
            # (2 unchanged attributes hidden)

          ~ backend {
              ~ address     = "firewall-prod-int-palo-prod.uksouth.cloudapp.azure.com" -> "firewall-prod-int-palo-cft-prod.uksouth.cloudapp.azure.com"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/backendPools/paybubble"
            name                = "paybubble"
            # (2 unchanged attributes hidden)

          ~ backend {
              ~ address     = "firewall-prod-int-palo-prod.uksouth.cloudapp.azure.com" -> "firewall-prod-int-palo-cft-prod.uksouth.cloudapp.azure.com"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/backendPools/manage-payments"
            name                = "manage-payments"
            # (2 unchanged attributes hidden)

          ~ backend {
              ~ address     = "firewall-prod-int-palo-prod.uksouth.cloudapp.azure.com" -> "firewall-prod-int-palo-cft-prod.uksouth.cloudapp.azure.com"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/backendPools/payment-outcome"
            name                = "payment-outcome"
            # (2 unchanged attributes hidden)

          ~ backend {
              ~ address     = "firewall-prod-int-palo-prod.uksouth.cloudapp.azure.com" -> "firewall-prod-int-palo-cft-prod.uksouth.cloudapp.azure.com"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/backendPools/idam-web-public"
            name                = "idam-web-public"
            # (2 unchanged attributes hidden)

          ~ backend {
              ~ address     = "firewall-prod-int-palo-prod.uksouth.cloudapp.azure.com" -> "firewall-prod-int-palo-cft-prod.uksouth.cloudapp.azure.com"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/backendPools/pcq"
            name                = "pcq"
            # (2 unchanged attributes hidden)

          ~ backend {
              ~ address     = "firewall-prod-int-palo-prod.uksouth.cloudapp.azure.com" -> "firewall-prod-int-palo-cft-prod.uksouth.cloudapp.azure.com"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/backendPools/lau"
            name                = "lau"
            # (2 unchanged attributes hidden)

          ~ backend {
              ~ address     = "firewall-prod-int-palo-prod.uksouth.cloudapp.azure.com" -> "firewall-prod-int-palo-cft-prod.uksouth.cloudapp.azure.com"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/backendPools/fact"
            name                = "fact"
            # (2 unchanged attributes hidden)

          ~ backend {
              ~ address     = "firewall-prod-int-palo-prod.uksouth.cloudapp.azure.com" -> "firewall-prod-int-palo-cft-prod.uksouth.cloudapp.azure.com"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/backendPools/fact-admin"
            name                = "fact-admin"
            # (2 unchanged attributes hidden)

          ~ backend {
              ~ address     = "firewall-prod-int-palo-prod.uksouth.cloudapp.azure.com" -> "firewall-prod-int-palo-cft-prod.uksouth.cloudapp.azure.com"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/backendPools/fact-redirect"
            name                = "fact-redirect"
            # (2 unchanged attributes hidden)

          ~ backend {
              ~ address     = "firewall-prod-int-palo-prod.uksouth.cloudapp.azure.com" -> "firewall-prod-int-palo-cft-prod.uksouth.cloudapp.azure.com"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/backendPools/jui-redirect"
            name                = "jui-redirect"
            # (2 unchanged attributes hidden)

          ~ backend {
              ~ address     = "firewall-prod-int-palo-prod.uksouth.cloudapp.azure.com" -> "firewall-prod-int-palo-cft-prod.uksouth.cloudapp.azure.com"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/backendPools/idam-web-admin"
            name                = "idam-web-admin"
            # (2 unchanged attributes hidden)

          ~ backend {
              ~ address     = "firewall-prod-int-palo-prod.uksouth.cloudapp.azure.com" -> "firewall-prod-int-palo-cft-prod.uksouth.cloudapp.azure.com"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/backendPools/idam-user-dashboard"
            name                = "idam-user-dashboard"
            # (2 unchanged attributes hidden)

          ~ backend {
              ~ address     = "firewall-prod-int-palo-prod.uksouth.cloudapp.azure.com" -> "firewall-prod-int-palo-cft-prod.uksouth.cloudapp.azure.com"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/backendPools/adoption"
            name                = "adoption"
            # (2 unchanged attributes hidden)

          ~ backend {
              ~ address     = "firewall-prod-int-palo-prod.uksouth.cloudapp.azure.com" -> "firewall-prod-int-palo-cft-prod.uksouth.cloudapp.azure.com"
                # (6 unchanged attributes hidden)
            }
        }





        # (203 unchanged blocks hidden)
    }

  # module.landing_zone.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "frontdoor_diagnostics" {
        id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod|fd-log-analytics"
        name                       = "fd-log-analytics"
        # (2 unchanged attributes hidden)

      - log {
          - category = "FrontdoorAccessLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      - log {
          - category = "FrontdoorWebApplicationFirewallLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1278,"Program":"tfcmt","SHA1":"","Target":"prod-global","Vars":{}} -->